### importar pandas

In [5]:
import pandas as pd

### lista de dados

In [6]:
emissions = pd.DataFrame({"country": ['China', 'United States', 'India'],
                         "year": ['2018', '2018', '2018'],
                         "co2_emissions": [10060000000.0, 54100000000.0, 26500000000.0]})

In [7]:
emissions

         country  year  co2_emissions
0          China  2018   1.006000e+10
1  United States  2018   5.410000e+10
2          India  2018   2.650000e+10

### definindo a quantidade de linhas a serem exibidas com set_options('display.max_rows', tam)

In [10]:
pd.set_option('display.max_rows', 2)
emissions

   country  year  co2_emissions
0    China  2018   1.006000e+10
..     ...   ...            ...
2    India  2018   2.650000e+10

[3 rows x 3 columns]

### definindo o formato decimal de como será exibido os valores

In [11]:
pd.options.display.float_format = '{:,.2f}'.format

In [12]:
emissions

   country  year     co2_emissions
0    China  2018 10,060,000,000.00
..     ...   ...               ...
2    India  2018 26,500,000,000.00

[3 rows x 3 columns]